from django.http import HttpResponse
from django.shortcuts import render

def index(request):
    """Обрабатывает запросы на главную страницу"""

    # Список текстов, которые будут меняться в приветствии
    texts = [
        {
            "title": "Добро пожаловать! 🤙",
            "desc": "Мы рады приветствовать вас в нашем магазине вязаных изделий ручной работы."
        },
        {
            "title": "Ручная работа 🧶",
            "desc": "Уникальные вязаные игрушки из гипоаллергенной пряжи."
        },
        {
            "title": "Тепло и уют ✨",
            "desc": "Каждое изделие связано с любовью и заботой о вас."
        },
    ]

    #latest_products = Product.objects.order_by('-id')[:3] #Последнии три товара (для раздела НОВИНКИ)
    #sale_products = Product.objects.filter(is_sale=True)[:3] #Товараы по скидки (отображаем максимум 3шт)

    context = {
        'title': "Вязаные изделия",
        'texts': texts,
    }
    return render(request, 'main/index.html', context)
